#[macro_use]
mod helper;

#[test]
fn pretty_format_query_call_1() {
    assert_fmt!(
        r#"#
перем результат = запрос.установитьПараметры(
   индекс, дата1, дата2,
   извлечь(массив[индекс1, индекс2, индекс3, "дата"], 00.00.00)
);
"#
    );
}

#[test]
fn pretty_format_query_call_2() {
    assert_fmt!(
        r#"#
Если(true)
{
   з_кор.УстановитьПараметры(
      НачалоМесяца(месяцРасчета), ПоследнееЧисло(месяцРасчета), НачалоМесяца(месяцРасчета),
      ПоследнееЧисло(месяцРасчета), месяцРасчета, Число(пДог)
   );
}
"#
    );
}

#[test]
fn pretty_format_query_call_with_object() {
    assert_fmt!(
        r#"#
з_кор.УстановитьПараметры(@{
   abonent: _идАбонента,
   contact: контакт,
   type: _оКонтакт.тип == 1 ? 0 : 1,
   flags: _оКонтакт.флаги,
   act: _актуален ? 1 : _оКонтакт.актуальность,
   id_base: _идбазы,
   ...зЗаявитель.params
}, true);
"#
    );
}

#[test]
fn pretty_format_query_call_with_object_and_comments() {
    assert_fmt!(
        r#"#
з_кор.УстановитьПараметры(@{
   abonent: _идАбонента,
   contact: контакт,
   # В КЦ 0 - моб. телефон, 1 - email
   type: _оКонтакт.тип == 1 ? 0 : 1,
   flags: _оКонтакт.флаги,
   act: _актуален ? 1 : _оКонтакт.актуальность,
   id_base: _идбазы,
   ...зЗаявитель.params
}, true);
"#
    );
}
